DataProcessors/бит_КопированиеЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_КопированиеЛицевогоСчета</Name>
			<Comment>Копирование лицевого счета</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗаведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проживающие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецКвартиры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрибытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСнятияСРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляПлощади</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КудаВыписан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КудаВыписанАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткудаПрибыл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткудаПрибылАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоустанавливающиеДокументы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаВыписки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПрописки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПроживания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусФизЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусФизЛицаДляИзменения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ШаблоныУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ОтветственныеЛицаПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ОтветственныеЛицаПоКУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ПричиныВыпискиПрописки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ПричиныВыпискиПрописки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПричинаВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаПрописки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СпособыРасчетаПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СпособыРасчетаПоУслугам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрупповымСчетчикамСНаличиемИндивидуальных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребленияНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницамПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЖилойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИндивидуальнымСчетчикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбщейПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОтапливаемойПлощади</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроживающимСНормативом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРаспределению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоСчетчикам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкаИзменениеУслугПоЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугиНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/бит_КопированиеЛицевогоСчета/Forms/Форма/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем мСписокКодовЧисел; // Переменная хранит список кодов чисел. На Клиенте.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура УправлениеДоступностьюЭлементовФормы()
	
	Элементы.Улица.Доступность    = ИзменитьАдрес;
	Элементы.Здание.Доступность   = ИзменитьАдрес;
	Элементы.Квартира.Доступность = ИзменитьАдрес;
	
	Элементы.ТипКвартиры.Доступность              = ИзменитьСведенияОКвартире;
	Элементы.СтатусКвартиры.Доступность           = ИзменитьСведенияОКвартире;
	Элементы.ТипПлиты.Доступность                 = ИзменитьСведенияОКвартире;
	Элементы.ТипЗапирающегоУстройства.Доступность = ИзменитьСведенияОКвартире;
	
	Элементы.ОбщаяПлощадь.Доступность        = ИзменитьСведенияОКвартире;
	Элементы.ОтапливаемаяПлощадь.Доступность = ИзменитьСведенияОКвартире;
	Элементы.СовокупнаяПлощадь.Доступность   = ИзменитьСведенияОКвартире;
	Элементы.ЖилаяПлощадь.Доступность        = ИзменитьСведенияОКвартире;
	Элементы.МОП.Доступность                 = ИзменитьСведенияОКвартире;
	
	Элементы.СообщениеАдрес.Видимость = НЕ ПустаяСтрока(СообщениеАдрес);
	
КонецПроцедуры // () 

&НаКлиенте
Функция ФормированиеАдресаДляФормы(Стр)
	
	ПредставлениеАдреса = ","
	+ СокрЛП(Стр.Поле1) + ","
	+ СокрЛП(Стр.Поле2) + ","
	+ СокрЛП(Стр.Поле3) + ","
	+ СокрЛП(Стр.Поле4) + ","
	+ СокрЛП(Стр.Поле5) + ","
	+ СокрЛП(Стр.Поле6) + ","                 
	+ СокрЛП(Стр.Поле7) + ","
	+ СокрЛП(Стр.Поле8) + ","
	+ СокрЛП(Стр.Поле9) + ","
	+ Строка(Стр.ТипДома)+ ","
	+ Строка(Стр.ТипКорпуса)+ ","
	+ Строка(Стр.ТипКвартиры)+",";
	
	Возврат ПредставлениеАдреса;
	
КонецФункции // ()

&НаКлиенте
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ДополнитьМассивИсключений(МассивИсключений)
	
	Если ИзменитьСведенияОКвартире Тогда
		
		МассивИсключений.Добавить("ТипЗапирающегоУстройства");
		МассивИсключений.Добавить("ТипКвартиры");
		МассивИсключений.Добавить("ТипПлиты");
		МассивИсключений.Добавить("СтатусКвартиры");
		МассивИсключений.Добавить("ЖилаяПлощадь");
		МассивИсключений.Добавить("ОбщаяПлощадь");
		МассивИсключений.Добавить("ОтапливаемаяПлощадь");
		МассивИсключений.Добавить("СовокупнаяПлощадь");
		МассивИсключений.Добавить("МОП");
		
	КонецЕсли;
	
КонецПроцедуры // ()

&НаКлиенте
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ОчиститьРеквизитыФормы(МассивИсключений = Неопределено)
	
	МассивНаОчистку = Новый Массив;
	МассивНаОчистку.Добавить("Улица");
	МассивНаОчистку.Добавить("Здание");
	МассивНаОчистку.Добавить("Квартира");
	МассивНаОчистку.Добавить("ТипЗапирающегоУстройства");
	МассивНаОчистку.Добавить("ТипКвартиры");
	МассивНаОчистку.Добавить("ТипПлиты");
	МассивНаОчистку.Добавить("СтатусКвартиры");
	МассивНаОчистку.Добавить("ЖилаяПлощадь");
	МассивНаОчистку.Добавить("ОбщаяПлощадь");
	МассивНаОчистку.Добавить("ОтапливаемаяПлощадь");
	МассивНаОчистку.Добавить("СовокупнаяПлощадь");
	МассивНаОчистку.Добавить("МОП");
	
	Для каждого Реквизит Из МассивНаОчистку Цикл
		
		Если НЕ МассивИсключений = Неопределено И НЕ МассивИсключений.Найти(Реквизит) = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Объект[Реквизит] = Неопределено;
		
		Если Реквизит = "Здание" Тогда
			Корпус = "";
		КонецЕсли;  
		
	КонецЦикла;
	
	СообщениеАдрес = "";
	
КонецПроцедуры // ()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаЗаведения = ТекущаяДата();
	
	Если НЕ Параметры.ЛицевойСчет.Пустая() Тогда
		
		Объект.ЛицевойСчет = Параметры.ЛицевойСчет;
		Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьОбъект(Объект, Параметры.ЛицевойСчет, Истина, Истина);
		
		СообщениеАдрес = ПроверитьНаличиеЛСПоАдресу(Объект.ЛицевойСчет, Объект.Квартира);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ОчиститьРеквизитыФормы();
	Объект.Проживающие.Очистить();
	Объект.Услуги.Очистить();
	
	ЛицевойСчетПриИзмененииНаСервере();
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностьюЭлементовФормы();
	
	мСписокКодовЧисел = Новый СписокЗначений;
	
	Для Значение = 48 По 57 Цикл
		мСписокКодовЧисел.Добавить(Значение); 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НовыйЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресПриИзменении(Элемент)
	
	УправлениеДоступностьюЭлементовФормы();
	
	Если НЕ ИзменитьАдрес Тогда
		
		// БИТ_ЖКХ 15.04.2014		
		// Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьОбъект(Объект, Объект.ЛицевойСчет, НЕ ИзменитьСведенияОКвартире);.
		ЗаполнитьОбъектНаСервере(Объект, Объект.ЛицевойСчет, НЕ ИзменитьСведенияОКвартире);
		// БИТ_ЖКХ 15.04.2014
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектНаСервере(Объект, ЛицевойСчет, ИзменитьСведенияОКвартире)
	
	Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьОбъект(Объект, Объект.ЛицевойСчет, НЕ ИзменитьСведенияОКвартире);
	
КонецПроцедуры
&НаКлиенте
Процедура ИзменитьСведенияОКвартиреПриИзменении(Элемент)
	
	УправлениеДоступностьюЭлементовФормы();
	
	Если НЕ ИзменитьСведенияОКвартире Тогда
		
		// БИТ_ЖКХ 15.04.2014
		// Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьСведенияОКвартире(Объект, Объект.Квартира);.
		ЗаполнитьСведенияОКвартиреНаСервере(Объект, Объект.Квартира);
		// БИТ_ЖКХ 15.04.2014
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОКвартиреНаСервере(Объект, Квартира)
	
	Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьСведенияОКвартире(Объект, Объект.Квартира);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЛицевогоСчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 23.05.2017 13:36:24 Начало правки...
	Если РазрешитьТекстЛС() Тогда
		Возврат;	
	КонецЕсли;
	// БИТ_ЖКХ 23.05.2017 13:36:24 Конец правки.
	
	Для Значение = 1 По СтрДлина(Текст) Цикл
		Если мСписокКодовЧисел.НайтиПоЗначению(КодСимвола(Текст,Значение)) = Неопределено Тогда
			СтандартнаяОбработка = Ложь;

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Введены некорректыне данные! Лицевой счет может содержать только цифры.");
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// БИТ_ЖКХ 23.05.2017 13:38:30 Начало правки...
&НаСервереБезКонтекста 
Функция РазрешитьТекстЛС()
	
	Возврат бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_РазрешитьТекстЛС");
	
КонецФункции
// БИТ_ЖКХ 23.05.2017 13:38:30 Конец правки.

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("Улица");
	ДополнитьМассивИсключений(МассивИсключений);
	ОчиститьРеквизитыФормы(МассивИсключений);
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("Улица");
	МассивИсключений.Добавить("Здание");
	ДополнитьМассивИсключений(МассивИсключений);
	
	ОчиститьРеквизитыФормы(МассивИсключений);
	
	Корпус = КорпусНаСервере(Объект.Здание);
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Функция КорпусНаСервере(Здание)
	
	Возврат Здание.Корпус;
	
КонецФункции	

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("Улица");
	МассивИсключений.Добавить("Здание");
	МассивИсключений.Добавить("Квартира");
	ДополнитьМассивИсключений(МассивИсключений);
	
	ОчиститьРеквизитыФормы(МассивИсключений);
	
	КвартираПриИзмененииНаСервере();
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("Улица", Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор", Отбор),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("Владелец", Объект.Здание);
	
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора",Новый Структура("Отбор", Отбор),Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляУслуги

&НаКлиенте
Процедура УслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокУслуг = ПолучитьСписокУслуг(Объект.ЛицевойСчет, Объект.ДатаЗаведения);
	
	Отбор = Новый Структура;
	
	Если НЕ СписокУслуг = Неопределено Тогда
		Отбор.Вставить("Ссылка", СписокУслуг);
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая",Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПоставщикНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.Услуга.Пустая() Тогда
		
		Список = ПолучитьСписокПоТаблицеУслуги(ТекущаяСтрока.Услуга, ТекущаяСтрока.Поставщик);
		Элементы.УслугиПоставщик.СписокВыбора.ЗагрузитьЗначения(Список);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиРежимПотребленияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.Услуга.Пустая() Тогда
		
		Список = ПолучитьСписокПоТаблицеУслуги(ТекущаяСтрока.Услуга, ТекущаяСтрока.РежимПотребления);
		Элементы.УслугиРежимПотребления.СписокВыбора.ЗагрузитьЗначения(Список);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСпособРасчетаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.Услуга.Пустая() Тогда
		
		Список = ПолучитьСписокПоТаблицеУслуги(ТекущаяСтрока.Услуга, ТекущаяСтрока.СпособРасчета);
		
		Элементы.УслугиСпособРасчета.СписокВыбора.ЗагрузитьЗначения(Список);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляПроживающие

&НаКлиенте
Процедура ПроживающиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	НоваяСтрока = Объект.Проживающие.Добавить();
	НоваяСтрока.СтатусФизЛица    = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация");
	НоваяСтрока.СтепеньРодства   = ПредопределенноеЗначение("Справочник.бит_СтепениРодстваФизЛиц.бит_НеУказано");
	НоваяСтрока.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Постоянно");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеВладелецКвартирыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Проживающие.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока.ВладелецКвартиры = ПредопределенноеЗначение("Перечисление.ДаНет.Да") Тогда
		
		ТекущаяСтрока.ДоляПлощади                   = 0;
		ТекущаяСтрока.ПравоустанавливающиеДокументы = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеФизЛицоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Проживающие.ТекущиеДанные;
	
	// Структура   с данными адреса.
	АдресУбытия = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(ТекущиеДанные.ФизЛицо, "Убытия", Истина);
	АдресПрибытия = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(ТекущиеДанные.ФизЛицо, "Прибытия", Истина);
	
	Если ЗначениеЗаполнено(АдресУбытия) Тогда
		
		ТекущиеДанные.КудаВыписан 		= АдресУбытия.Представление;
		ТекущиеДанные.КудаВыписанАдрес 	= ФормированиеАдресаДляФормы(АдресУбытия);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(АдресПрибытия) Тогда
		
		ТекущиеДанные.ОткудаПрибыл 		= Строка(АдресПрибытия.Представление);
		ТекущиеДанные.ОткудаПрибылАдрес = ФормированиеАдресаДляФормы(АдресПрибытия);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеДоляПлощадиПриИзменении(Элемент)
	
	СуммаДолей = Объект.Проживающие.Итог("ДоляПлощади");
	
	Если СуммаДолей > 1 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Суммарная доля площади превышает максимальную (1) на " + Строка(СуммаДолей -1) +".");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеДатаСнятияСРегистрацииПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Проживающие.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) И НачалоДня(ТекСтрока.ДатаСнятияСРегистрации) <= НачалоДня(ТекущаяДата()) Тогда
		
		ТекСтрока.СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан");

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Статус физ лица "+ТекСтрока.ФизЛицо+" изменен на ""Удален с лицевого счета""!");
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) ИЛИ (ТекСтрока.ДатаСнятияСРегистрации >= ТекущаяДата()
		
		// БИТ_ЖКХ 15.04.2014
		// И ТекСтрока.СтатусФизЛица = Справочники.бит_СтатусФизЛица.Выписан) Тогда.
		И ТекСтрока.СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан")) Тогда
		// БИТ_ЖКХ 15.04.2014
		
		ТекСтрока.СтатусФизЛица = Неопределено;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Заполните статус физ лица : " + ТекСтрока.ФизЛицо + "!");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеПричинаПропискиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ОткрытьФорму("Справочник.бит_ПричиныВыписки.Форма.ФормаВыбораУправляемая",,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВидПричины");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = ПредопределенноеЗначение("Перечисление.бит_ПричиныВыпискиПрописки.ПричинаВыписки");
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ФормаВыбора.ТекущийЭлемент.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеПричинаВыпискиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ОткрытьФорму("Справочник.бит_ПричиныВыписки.Форма.ФормаВыбораУправляемая",,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ВидПричины");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение   = ПредопределенноеЗначение("Перечисление.бит_ПричиныВыпискиПрописки.ПричинаВыписки");
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ФормаВыбора.ТекущийЭлемент.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеОткудаПрибылНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ФормаМод = Результат;
	
	Если ЗначениеЗаполнено(ФормаМод.ПредставлениеАдреса) Тогда
		ТекущиеДанные.ОткудаПрибылАдрес = ФормаМод.ПредставлениеАдреса;
		ТекущиеДанные.ОткудаПрибыл      = ФормаМод.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеКудаВыписанНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ФормаМод = Результат;
	
	Если ЗначениеЗаполнено(ФормаМод.ПредставлениеАдреса) Тогда
		ТекущиеДанные.КудаВыписанАдрес = ФормаМод.ПредставлениеАдреса;
		ТекущиеДанные.КудаВыписан      = ФормаМод.Представление;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ПолучитьСписокУслуг(ЛицевойСчет, Дата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"  , КонецДня(Дата));
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Здание);
	Запрос.УстановитьПараметр("Улица" , ЛицевойСчет.УлицаЛицевогоСчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Улица,
	|	бит_ШаблоныУслугСрезПоследних.Здание,
	|	бит_ШаблоныУслугСрезПоследних.Услуга,
	|	бит_ШаблоныУслугСрезПоследних.Поставщик
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(
	|			&Дата,
	|			Здание = &Здание
	|				И Улица = &Улица) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокУслуг = Новый СписокЗначений;
	
	СписокУслуг.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокУслуг;
	
КонецФункции // ()

&НаСервереБезКонтекста
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ПолучитьСписокПоТаблицеУслуги(Услуга, Приемник)
	
	ИмяПоля    = "";
	ИмяТаблицы = "";
	Если ТипЗнч(Приемник) = Тип("СправочникСсылка.бит_РежимыПотребленияУслуг") Тогда
		
		ИмяПоля    = "РежимПотребленияУслуг";
		ИмяТаблицы = "РежимыПотребленияУслуг";
		
	ИначеЕсли ТипЗнч(Приемник) = Тип("СправочникСсылка.бит_ПоставщикиУслуг") Тогда 
		
		ИмяПоля    = "Поставщик";
		ИмяТаблицы = "Поставщики";
		
	ИначеЕсли ТипЗнч(Приемник) = Тип("ПеречислениеСсылка.бит_СпособыРасчетаПоУслугам") Тогда 
		
		ИмяПоля    = "СпособРасчета";
		ИмяТаблицы = "СпособыРасчета";
		
	КонецЕсли;
	
	Если ИмяПоля = "" ИЛИ ИмяТаблицы = "" Тогда
		Возврат Новый Массив;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица."+ИмяПоля+" КАК Ссылка
	|ИЗ
	|	Справочник.бит_УслугиЖКХ."+ИмяТаблицы+" КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Услуга";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Список = Результат.ВыгрузитьКолонку("Ссылка");
	
	Поиск = Список.Найти(Перечисления.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам);
	Если НЕ Поиск = Неопределено Тогда
		Список.Удалить(Поиск);
	КонецЕсли; 
	
	Возврат Список;
	
КонецФункции // ()

&НаКлиенте
Процедура ЗаполнитьПоЛС(Команда)
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоЛСЗавершение", ЭтотОбъект), "Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЛСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Услуги.Очистить();
		
		// БИТ_ЖКХ 15.04.2014
		ЗаполнитьСведенияПоУслугамНаСервере();
		// Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьСведенияПоУслугам(Объект, Объект.ЛицевойСчет);.
		// БИТ_ЖКХ 15.04.2014
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСведенияПоУслугамНаСервере()
	
	Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьСведенияПоУслугам(Объект, Объект.ЛицевойСчет);
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборИзСправочника(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элементы.Проживающие);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроживающихИзЛС(Команда)
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПроживающихИзЛСЗавершение", ЭтотОбъект), "Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроживающихИзЛСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Проживающие.Очистить();
		ЗаполнитьПриживающихИзЛСНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроживающиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			
			Отбор = Новый Структура("ФизЛицо", ЭлементМассива);
			Поиск = Объект.Проживающие.НайтиСтроки(Отбор);
			
			Если Поиск.количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = Объект.Проживающие.Добавить();
			НоваяСтрока.ФизЛицо          = ЭлементМассива;
			НоваяСтрока.СтатусФизЛица    = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация");
			НоваяСтрока.СтепеньРодства   = ПредопределенноеЗначение("Справочник.бит_СтепениРодстваФизЛиц.бит_НеУказано");
			НоваяСтрока.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Постоянно");
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьПриживающихИзЛСНаСервере()
	
	Запрос =  Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
	|	ОтветственныеЛицаПоКУСрезПоследних.Контрагент,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныеЛицаПоКУСрезПоследних
	|		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет = ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|			И ПроживающиеПоЛССрезПоследних.ФизЛицо = ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("Момент"     ,КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет",Объект.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Объект.Проживающие.Загрузить(РезультатЗапроса);
	
КонецПроцедуры // () 

&НаКлиенте
Процедура СкопироватьЛицевойСчет(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Результат = СкопироватьЛицевойСчетНаСервере();
		
		Если Результат.НетОшибок Тогда

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Копирование лицевого счета завершено успешно.");
			
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Результат.ТекстОшибки);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция СкопироватьЛицевойСчетНаСервере()
	
	Результат = Новый Структура;
	Результат.Вставить("НетОшибок"  , Истина);
	Результат.Вставить("ТекстОшибки", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",Объект.НаименованиеЛицевогоСчета);
	
	Если Не Запрос.Выполнить().Пустой() тогда
		Результат.НетОшибок   = Ложь;
		Результат.ТекстОшибки = "Введенный лицевой счет уже существует.";
		Возврат Результат;
	КонецЕсли;
	
	НовыйЛС = Справочники.бит_ЛицевыеСчета.СоздатьЭлемент();
	
	СписокИсключений = "Родитель,Владелец";
	ЗаполнитьЗначенияСвойств(НовыйЛС, Объект.ЛицевойСчет,,СписокИсключений);
	
	НовыйЛС.УстановитьНовыйКод();
	НовыйЛС.Наименование       = Объект.НаименованиеЛицевогоСчета;
	НовыйЛС.Идентификатор      = 0;
	НовыйЛС.УлицаЛицевогоСчета = Объект.Улица;
	НовыйЛС.Здание             = Объект.Здание;
	НовыйЛС.Квартира           = Объект.Квартира;
	
	Попытка
		НовыйЛС.Записать();
		Объект.НовыйЛицевойСчет = НовыйЛС.Ссылка;
	Исключение
		Результат.НетОшибок   = Ложь;
		Результат.ТекстОшибки = ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки; 
	
	Если ИзменитьСведенияОКвартире Тогда
		
		НоваяЗаписьСВ = РегистрыСведений.бит_СведенияОКвартире.СоздатьМенеджерЗаписи();
		НоваяЗаписьСВ.Период   = НачалоМесяца(Объект.ДатаЗаведения);
		НоваяЗаписьСВ.Квартира = Объект.Квартира;
		НоваяЗаписьСВ.Прочитать();
		
		ЗаполнитьЗначенияСвойств(НоваяЗаписьСВ, Объект);
		
		Попытка
			НоваяЗаписьСВ.Записать();
		Исключение
			Результат.НетОшибок   = Ложь;
			Результат.ТекстОшибки = ОписаниеОшибки();
			Возврат Результат;
		КонецПопытки;
		
	КонецЕсли; 
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		ДокументУслуги = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент();
		
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ДокументУслуги

		,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
		ДокументУслуги.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет;
		ДокументУслуги.Дата        = Объект.ДатаЗаведения;
		ДокументУслуги.ЛицевойСчет = Объект.НовыйЛицевойСчет;
		ДокументУслуги.Улица       = Объект.Улица;
		ДокументУслуги.Здание      = Объект.Здание;
		ДокументУслуги.Комментарий = "Документ создан автоматически из обработки ""Копирование лицевого счета"".";
		
		Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
			
			НоваяСтрока = ДокументУслуги.ЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла; 
		
		Попытка
			ДокументУслуги.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Результат.НетОшибок   = Ложь;
			Результат.ТекстОшибки = ОписаниеОшибки();
			Возврат Результат;
		КонецПопытки; 
		
	КонецЕсли;
	
	Если Объект.Проживающие.Количество() > 0 Тогда
		
		ДокументПроживающие = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент();
		
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ДокументПроживающие

		,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
		ДокументПроживающие.Дата        = Объект.ДатаЗаведения;
		ДокументПроживающие.ЛицевойСчет = Объект.НовыйЛицевойСчет;
		ДокументПроживающие.Комментарий = "Документ создан автоматически из обработки ""Копирование лицевого счета"".";
		
		Для каждого СтрокаТаблицы Из Объект.Проживающие Цикл
			
			НоваяСтрока = ДокументПроживающие.СписокПроживающих.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла; 
		
		Попытка
			ДокументПроживающие.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Результат.НетОшибок   = Ложь;
			Результат.ТекстОшибки = ОписаниеОшибки();
			Возврат Результат;
		КонецПопытки; 
		
	КонецЕсли;
	
	Если ОтключитьУслуги Тогда
		
		ДокументУслугиУдаление = Документы.бит_УстановкаИзменениеУслугПоЛС.СоздатьДокумент();
		
		бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ДокументУслугиУдаление
		
		,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
		ДокументУслугиУдаление.ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугНаЛицевойСчет;
		ДокументУслугиУдаление.Дата        = Объект.ДатаЗаведения;
		ДокументУслугиУдаление.ЛицевойСчет = Объект.ЛицевойСчет;
		ДокументУслугиУдаление.Улица       = Объект.ЛицевойСчет.УлицаЛицевогоСчета;
		ДокументУслугиУдаление.Здание      = Объект.ЛицевойСчет.Здание;
		ДокументУслугиУдаление.Комментарий = "Документ создан автоматически из обработки ""Копирование лицевого счета"".";
		
		ДокументУслугиУдаление.ЗаполнитьПоследнимиЗначениями();
		
		Для каждого СтрокаТаблицы Из ДокументУслугиУдаление.ЛицевыеСчета Цикл
			СтрокаТаблицы.РежимПотребления = Справочники.бит_РежимыПотребленияУслуг.Нет;
		КонецЦикла; 
		
		Попытка
			ДокументУслугиУдаление.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Результат.НетОшибок   = Ложь;
			Результат.ТекстОшибки = ОписаниеОшибки();
			Возврат Результат;
		КонецПопытки; 
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // () 

&НаСервере
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура КвартираПриИзмененииНаСервере()
	
	Если Не ИзменитьСведенияОКвартире Тогда
		Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьСведенияОКвартире(Объект, Объект.Квартира);
	КонецЕсли;
	
	// Проверка наличия других ЛС по адресу.
	СообщениеАдрес = ПроверитьНаличиеЛСПоАдресу(Объект.ЛицевойСчет, Объект.Квартира);
	
КонецПроцедуры // ()

&НаСервереБезКонтекста
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ПроверитьНаличиеЛСПоАдресу(ЛицевойСчет, Квартира)
	
	Сообщение = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Квартира"   , Квартира);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Наименование
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Квартира = &Квартира
	|	И бит_ЛицевыеСчета.Ссылка <> &ЛицевойСчет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Текст = "По данному адресу найдены лицевые счета: ";
	
	Пока Выборка.Следующий() Цикл
		Сообщение = Сообщение + Выборка.Наименование + " ";
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Сообщение) Тогда
		Сообщение = Текст + Сообщение; 
	КонецЕсли; 
	
	Возврат Сообщение;
	
КонецФункции // ПроверитьНаличиеЛСПоАдресу()

&НаСервере
// Процедура. 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЛицевойСчетПриИзмененииНаСервере()
	
	Обработки.бит_КопированиеЛицевогоСчета.ЗаполнитьОбъект(Объект, Объект.ЛицевойСчет, Истина, Истина);
	
	СообщениеАдрес = ПроверитьНаличиеЛСПоАдресу(Объект.ЛицевойСчет, Объект.Квартира);
	
КонецПроцедуры // () 

#КонецОбласти
